
## Plan Result (prod_twingate)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.access_token[&#34;birds-birds-connector&#34;]
  * azurerm_key_vault_secret.refresh_token[&#34;birds-birds-connector&#34;]
  * twingate_connector.this[&#34;birds-birds-connector&#34;]
  * twingate_connector_tokens.this[&#34;birds-birds-connector&#34;]
  * twingate_group.this[&#34;birds&#34;]
  * twingate_remote_network.this[&#34;birds&#34;]
  * twingate_resource.this[&#34;birds-gateway&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.access_token["birds-birds-connector"] will be created
  + resource "azurerm_key_vault_secret" "access_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ca9663cd-26bb-4c47-b084-e527a512d372/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault"
      + name                    = "Twingate-birds-connector-Access-Token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.refresh_token["birds-birds-connector"] will be created
  + resource "azurerm_key_vault_secret" "refresh_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ca9663cd-26bb-4c47-b084-e527a512d372/resourceGroups/common/providers/Microsoft.KeyVault/vaults/bancey-vault"
      + name                    = "Twingate-birds-connector-Refresh-Token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # twingate_connector.this["birds-birds-connector"] will be created
  + resource "twingate_connector" "this" {
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + name                   = "birds-connector"
      + private_ips            = (known after apply)
      + public_ip              = (known after apply)
      + remote_network_id      = (known after apply)
      + state                  = (known after apply)
      + status_updates_enabled = true
      + version                = (known after apply)
    }

  # twingate_connector_tokens.this["birds-birds-connector"] will be created
  + resource "twingate_connector_tokens" "this" {
      + access_token  = (sensitive value)
      + connector_id  = (known after apply)
      + id            = (known after apply)
      + refresh_token = (sensitive value)
    }

  # twingate_group.this["birds"] will be created
  + resource "twingate_group" "this" {
      + id                 = (known after apply)
      + is_authoritative   = (known after apply)
      + name               = "birds"
      + security_policy_id = (known after apply)
    }

  # twingate_remote_network.this["birds"] will be created
  + resource "twingate_remote_network" "this" {
      + id       = (known after apply)
      + location = "ON_PREMISE"
      + name     = "birds"
      + type     = "REGULAR"
    }

  # twingate_resource.this["birds-gateway"] will be created
  + resource "twingate_resource" "this" {
      + address                     = "192.168.1.250"
      + alias                       = ""
      + id                          = (known after apply)
      + is_active                   = true
      + is_authoritative            = (known after apply)
      + is_browser_shortcut_enabled = false
      + is_visible                  = true
      + name                        = "birds-gateway"
      + protocols                   = {
          + allow_icmp = true
          + tcp        = {
              + policy = "ALLOW_ALL"
              + ports  = []
            }
          + udp        = {
              + policy = "ALLOW_ALL"
              + ports  = []
            }
        }
      + remote_network_id           = (known after apply)
      + security_policy_id          = "U2VjdXJpdHlQb2xpY3k6MzE2OTYy"

      + access_group {
          + group_id           = "R3JvdXA6MjE2NzU4"
          + security_policy_id = "U2VjdXJpdHlQb2xpY3k6MzE2OTYy"
        }
      + access_group {
          + group_id           = (known after apply)
          + security_policy_id = "U2VjdXJpdHlQb2xpY3k6MzE2OTYy"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":613,"Program":"tfcmt","SHA1":"","Target":"prod_twingate","Vars":{}} -->